zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00100.atdf
        <register name="TPR" offset="0xE40" rw="RW" size="4" access-size="4" caption="ITM Trace Privilege Register">
          <bitfield name="PRIVMASK0" caption="Privilege mask for stimulus port byte 0" mask="0x1"/>
          <bitfield name="PRIVMASK1" caption="Privilege mask for stimulus port byte 1" mask="0x2"/>
          <bitfield name="PRIVMASK2" caption="Privilege mask for stimulus port byte 2" mask="0x4"/>
          <bitfield name="PRIVMASK3" caption="Privilege mask for stimulus port byte 3" mask="0x8"/>
          <bitfield name="PRIVMASK4" caption="Privilege mask for stimulus port byte 4" mask="0x10"/>
          <bitfield name="PRIVMASK5" caption="Privilege mask for stimulus port byte 5" mask="0x20"/>
          <bitfield name="PRIVMASK6" caption="Privilege mask for stimulus port byte 6" mask="0x40"/>
          <bitfield name="PRIVMASK7" caption="Privilege mask for stimulus port byte 7" mask="0x80"/>
          <bitfield name="PRIVMASK8" caption="Privilege mask for stimulus port byte 8" mask="0x100"/>
          <bitfield name="PRIVMASK9" caption="Privilege mask for stimulus port byte 9" mask="0x200"/>
          <bitfield name="PRIVMASK10" caption="Privilege mask for stimulus port byte 10" mask="0x400"/>
          <bitfield name="PRIVMASK11" caption="Privilege mask for stimulus port byte 11" mask="0x800"/>
          <bitfield name="PRIVMASK12" caption="Privilege mask for stimulus port byte 12" mask="0x1000"/>
          <bitfield name="PRIVMASK13" caption="Privilege mask for stimulus port byte 13" mask="0x2000"/>
          <bitfield name="PRIVMASK14" caption="Privilege mask for stimulus port byte 14" mask="0x4000"/>
          <bitfield name="PRIVMASK15" caption="Privilege mask for stimulus port byte 15" mask="0x8000"/>
          <bitfield name="PRIVMASK16" caption="Privilege mask for stimulus port byte 16" mask="0x10000"/>
          <bitfield name="PRIVMASK17" caption="Privilege mask for stimulus port byte 17" mask="0x20000"/>
          <bitfield name="PRIVMASK18" caption="Privilege mask for stimulus port byte 18" mask="0x40000"/>
          <bitfield name="PRIVMASK19" caption="Privilege mask for stimulus port byte 19" mask="0x80000"/>
          <bitfield name="PRIVMASK20" caption="Privilege mask for stimulus port byte 20" mask="0x100000"/>
          <bitfield name="PRIVMASK21" caption="Privilege mask for stimulus port byte 21" mask="0x200000"/>
          <bitfield name="PRIVMASK22" caption="Privilege mask for stimulus port byte 22" mask="0x400000"/>
          <bitfield name="PRIVMASK23" caption="Privilege mask for stimulus port byte 23" mask="0x800000"/>
          <bitfield name="PRIVMASK24" caption="Privilege mask for stimulus port byte 24" mask="0x1000000"/>
          <bitfield name="PRIVMASK25" caption="Privilege mask for stimulus port byte 25" mask="0x2000000"/>
          <bitfield name="PRIVMASK26" caption="Privilege mask for stimulus port byte 26" mask="0x4000000"/>
          <bitfield name="PRIVMASK27" caption="Privilege mask for stimulus port byte 27" mask="0x8000000"/>
          <bitfield name="PRIVMASK28" caption="Privilege mask for stimulus port byte 28" mask="0x10000000"/>
          <bitfield name="PRIVMASK29" caption="Privilege mask for stimulus port byte 29" mask="0x20000000"/>
          <bitfield name="PRIVMASK30" caption="Privilege mask for stimulus port byte 30" mask="0x40000000"/>
          <bitfield name="PRIVMASK31" caption="Privilege mask for stimulus port byte 31" mask="0x80000000"/>
        </register>
        <register name="TCR" offset="0xE80" rw="RW" size="4" access-size="4" caption="ITM Trace Control Register">
          <bitfield name="ITMENA" caption="ITM enable" mask="0x1"/>
          <bitfield name="TSENA" caption="Timestamp enable" mask="0x2"/>
          <bitfield name="SYNCENA" caption="Synchronization enable" mask="0x4"/>
          <bitfield name="TXENA" caption="Transmit enable" mask="0x8"/>
          <bitfield name="SWOENA" caption="SWO enable" mask="0x10"/>
          <bitfield name="STALLENA" caption="Stall enable" mask="0x20"/>
          <bitfield name="TSPrescale" caption="Timestamp prescale" mask="0x300"/>
          <bitfield name="GTSFREQ" caption="Global timestamp frequency" mask="0xC00"/>
          <bitfield name="TraceBusID" caption="Trace bus identity" mask="0x7F0000"/>
          <bitfield name="BUSY" caption="ITM busy" mask="0x800000"/>
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="ITM Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="LAR__KEY"/>
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="ITM Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A01" caption="ITM Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="ITM Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="ITM Peripheral Identification Register 5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="ITM Peripheral Identification Register 6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ITM Peripheral Identification Register 7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
