zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00100.atdf
        <register name="MCRAMC_FLTCTRL" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Control Register">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="MCRAMC_FLTCTRL__FLTEN"/>
          <bitfield name="FLTMD" caption="Fault Injection Mode" mask="0x3000"/>
        </register>
        <register name="MCRAMC_FLTPTR" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Pointer Register">
          <bitfield name="FLT1PTR" caption="Single Fault Injection Bit Pointer" mask="0xFF"/>
          <bitfield name="FLT2PTR" caption="Double Fault Injection Bit Pointer" mask="0xFF0000"/>
        </register>
        <register name="MCRAMC_FLTADR" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Address Register">
          <bitfield name="FLTADR" caption="Fault Address Offset" mask="0xFFFFFF"/>
        </register>
        <register name="MCRAMC_ERRCADR" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Address Register">
          <bitfield name="ERCADR" caption="ECC SECDED Error Capture Address" mask="0xFFFFFF"/>
        </register>
        <register name="MCRAMC_ERRCPAR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Parity Register">
          <bitfield name="ERCPAR" caption="ECC SECDED Error Capture Parity" mask="0xFF"/>
        </register>
        <register name="MCRAMC_ERRCSYN" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Syndrome Register">
          <bitfield name="ERCSYN" caption="ECC SECDED Error Capture Syndrome" mask="0xFF" values="MCRAMC_ERRCSYN__ERCSYN"/>
          <bitfield name="ERR1" caption="ECC Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="ECC Double Bit Error" mask="0x8000" values="MCRAMC_ERRCSYN__ERR2"/>
        </register>
        <register name="MCRAMC_VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000510" caption="Version Register">
          <bitfield name="VERSION" caption="MCRAMC Version" mask="0xFFF"/>
          <bitfield name="MFN" caption="Metal Fix Number" mask="0x70000"/>
        </register>
      </register-group>
      <value-group name="MCRAMC_CTRLA__SWRST">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." value="1"/>
      </value-group>
      <value-group name="MCRAMC_CTRLA__ENABLE">
        <value name="0" caption="ECC decoding is disabled." value="0"/>
        <value name="1" caption="ECC decoding is enabled." value="1"/>
      </value-group>
      <value-group name="MCRAMC_FLTCTRL__FLTEN">
        <value name="0" caption="Disables fault injection." value="0"/>
        <value name="1" caption="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." value="1"/>
      </value-group>
      <value-group name="MCRAMC_ERRCSYN__ERCSYN">
        <value name="0" caption="Not a Single bit error." value="0"/>
        <value name="1" caption="Single bit error." value="1"/>
      </value-group>
      <value-group name="MCRAMC_ERRCSYN__ERR2">
        <value name="0" caption="Not a Double bit error." value="0"/>
        <value name="1" caption="Double bit error." value="1"/>
      </value-group>
    </module>
    <module name="MPU" id="SYSTEM_IP" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00"/>
        </register>
        <register name="CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4"/>
        </register>
        <register name="RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF"/>
        </register>
        <register name="RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="RBAR__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="RBAR__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RBAR_A" offset="0x14" rw="RW" size="4" access-size="4" count="4" caption="MPU Region Base Address Register Alias x">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="RBAR_A__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="RBAR_A__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RLAR_A" offset="0x18" rw="RW" size="4" access-size="4" count="4" caption="MPU Region Limit Address Register Alias x">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
        <register name="MAIR0" offset="0x30" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 0">
          <bitfield name="Attr0" caption="Attribute of MPU region 0" mask="0xFF"/>
          <bitfield name="Attr1" caption="Attribute of MPU region 1" mask="0xFF00"/>
          <bitfield name="Attr2" caption="Attribute of MPU region 2" mask="0xFF0000"/>
          <bitfield name="Attr3" caption="Attribute of MPU region 3" mask="0xFF000000"/>
        </register>
        <register name="MAIR1" offset="0x34" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 1">
          <bitfield name="Attr4" caption="Attribute of MPU region 4" mask="0xFF"/>
          <bitfield name="Attr5" caption="Attribute of MPU region 5" mask="0xFF00"/>
          <bitfield name="Attr6" caption="Attribute of MPU region 6" mask="0xFF0000"/>
          <bitfield name="Attr7" caption="Attribute of MPU region 7" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="RBAR__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0"/>
        <value name="RWANY" caption="Read/write by any privilege level" value="1"/>
        <value name="RPRIV" caption="Read-only by privileged code only" value="2"/>
        <value name="RANY" caption="Read-only by any privilege level" value="3"/>
      </value-group>
      <value-group name="RBAR__SH">
        <value name="NO" caption="Non-shareable" value="0"/>
        <value name="OUTER" caption="Outer shareable" value="2"/>
        <value name="INNER" caption="Inner shareable" value="3"/>
      </value-group>
