zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00100.atdf
        <register name="SHCSR" offset="0x24" rw="RW" size="4" access-size="4" caption="System Handler Control and State Register">
          <bitfield name="HARDFAULTACT" caption="HardFault exception active state" mask="0x4"/>
          <bitfield name="NMIACT" caption="NMI exception active state" mask="0x20"/>
          <bitfield name="SVCALLACT" caption="SVCall exception active state" mask="0x80"/>
          <bitfield name="PENDSVACT" caption="PendSV exception active state" mask="0x400"/>
          <bitfield name="SYSTICKACT" caption="SysTick exception active state" mask="0x800"/>
          <bitfield name="SVCALLPENDED" caption="SVCall exception pended state" mask="0x8000"/>
          <bitfield name="HARDFAULTPENDED" caption="HardFault exception pended state" mask="0x200000"/>
        </register>
        <register name="CFSR" offset="0x28" rw="RW" size="4" access-size="4" caption="Configurable Fault Status Register">
          <bitfield name="IACCVIOL" caption="Instruction access violation flag" mask="0x1"/>
          <bitfield name="DACCVIOL" caption="Data access violation flag" mask="0x2"/>
          <bitfield name="MUNSTKERR" caption="MemManage unstacking error flag" mask="0x8"/>
          <bitfield name="MSTKERR" caption="MemManage stacking error flag" mask="0x10"/>
          <bitfield name="MLSPERR" caption="MemManage lazy state preservation error flag" mask="0x20"/>
          <bitfield name="MMFARVALID" caption="MMFAR valid flag" mask="0x80"/>
          <bitfield name="IBUSERR" caption="Instruction bus error" mask="0x100"/>
          <bitfield name="PRECISERR" caption="Precise error" mask="0x200"/>
          <bitfield name="IMPRECISERR" caption="Imprecise error" mask="0x400"/>
          <bitfield name="UNSTKERR" caption="Unstack error" mask="0x800"/>
          <bitfield name="STKERR" caption="Stack error" mask="0x1000"/>
          <bitfield name="LSPERR" caption="Lazy state preservation error" mask="0x2000"/>
          <bitfield name="BFARVALID" caption="BFAR valid" mask="0x8000"/>
          <bitfield name="UNDEFINSTR" caption="Undefined instruction flag" mask="0x10000"/>
          <bitfield name="INVSTATE" caption="Invalid state flag" mask="0x20000"/>
          <bitfield name="INVPC" caption="Invalid PC flag" mask="0x40000"/>
          <bitfield name="NOCP" caption="No coprocessor flag" mask="0x80000"/>
          <bitfield name="STKOF" caption="Stack overflow flag" mask="0x100000"/>
          <bitfield name="UNALIGNED" caption="Unaligned access flag" mask="0x1000000"/>
          <bitfield name="DIVBYZERO" caption="Divide by zero flag" mask="0x2000000"/>
        </register>
        <register name="MMFSR" offset="0x28" rw="RW" size="1" access-size="1" caption="MemManage Fault Status Register">
          <bitfield name="IACCVIOL" caption="Instruction access violation flag" mask="0x1"/>
          <bitfield name="DACCVIOL" caption="Data access violation flag" mask="0x2"/>
          <bitfield name="MUNSTKERR" caption="MemManage unstacking error flag" mask="0x8"/>
          <bitfield name="MSTKERR" caption="MemManage stacking error flag" mask="0x10"/>
          <bitfield name="MLSPERR" caption="MemManage lazy state preservation error flag" mask="0x20"/>
          <bitfield name="MMFARVALID" caption="MMFAR valid flag" mask="0x80"/>
        </register>
        <register name="BFSR" offset="0x29" rw="RW" size="1" access-size="1" caption="BusFault Status Register">
          <bitfield name="IBUSERR" caption="Instruction bus error" mask="0x1"/>
          <bitfield name="PRECISERR" caption="Precise error" mask="0x2"/>
          <bitfield name="IMPRECISERR" caption="Imprecise error" mask="0x4"/>
          <bitfield name="UNSTKERR" caption="Unstack error" mask="0x8"/>
          <bitfield name="STKERR" caption="Stack error" mask="0x10"/>
          <bitfield name="LSPERR" caption="Lazy state preservation error" mask="0x20"/>
          <bitfield name="BFARVALID" caption="BFAR valid" mask="0x80"/>
        </register>
        <register name="UFSR" offset="0x2A" rw="RW" size="2" access-size="2" caption="UsageFault Status Register">
          <bitfield name="UNDEFINSTR" caption="Undefined instruction flag" mask="0x1"/>
          <bitfield name="INVSTATE" caption="Invalid state flag" mask="0x2"/>
          <bitfield name="INVPC" caption="Invalid PC flag" mask="0x4"/>
          <bitfield name="NOCP" caption="No coprocessor flag" mask="0x8"/>
          <bitfield name="STKOF" caption="Stack overflow flag" mask="0x10"/>
          <bitfield name="UNALIGNED" caption="Unaligned access flag" mask="0x100"/>
          <bitfield name="DIVBYZERO" caption="Divide by zero flag" mask="0x200"/>
        </register>
        <register name="HFSR" offset="0x2C" rw="RW" size="4" access-size="4" caption="HardFault Status Register">
          <bitfield name="VECTTBL" caption="Vector table read error" mask="0x2"/>
          <bitfield name="FORCED" caption="Forced, configurable-priority exception escalated to HardFault" mask="0x40000000"/>
          <bitfield name="DEBUGEVT" caption="Debug event" mask="0x80000000"/>
        </register>
        <register name="DFSR" offset="0x30" rw="RW" size="4" access-size="4" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt or step event" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="Watchpoint event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector Catch event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="External event" mask="0x10"/>
        </register>
        <register name="MMFAR" offset="0x34" rw="RW" size="4" access-size="4" caption="MemManage Fault Address Register">
          <bitfield name="ADDRESS" caption="Data address for a MemManage fault" mask="0xFFFFFFFF"/>
        </register>
        <register name="BFAR" offset="0x38" rw="RW" size="4" access-size="4" caption="BusFault Address Register">
          <bitfield name="ADDRESS" caption="Data address for a precise BusFault" mask="0xFFFFFFFF"/>
        </register>
        <register name="AFSR" offset="0x3C" rw="RW" size="4" access-size="4" caption="Auxiliary Fault Status Register">
        </register>
        <register name="ID_PFR0" offset="0x40" rw="R" size="4" access-size="4" initval="0x00000030" caption="Processor Feature Register 0">
          <bitfield name="State0" caption="State two, A32 instruction set support" mask="0xF"/>
          <bitfield name="State1" caption="State one, T32 instruction set support" mask="0xF0"/>
        </register>
